{
  "architectures": [
    "Transformer"
  ],
  "model_type": "gpt2",
  "vocab_size": 50260,
  "n_positions": 256,
  "n_embd": 512,
  "n_layer": 8,
  "n_head": 8,
  "n_inner": 2048,
  "activation_function": "gelu",
  "resid_pdrop": 0.1,
  "embd_pdrop": 0.1,
  "attn_pdrop": 0.1,
  "layer_norm_epsilon": 1e-8,
  "initializer_range": 0.02,
  "summary_type": "cls_index",
  "summary_use_proj": true,
  "summary_activation": null,
  "summary_proj_to_labels": true,
  "summary_first_dropout": 0.1,
  "scale_attn_weights": true,
  "use_cache": true,
  "bos_token_id": 50256,
  "eos_token_id": 50256,
  "pad_token_id": 50257,
  "tie_word_embeddings": true,
  "transformer_block_type": "pre_ln_rms_rope",
  "rotary_emb": true,
  "norm_type": "rms",
  "torch_dtype": "bfloat16",
  "hidden_dropout_prob": 0.1
}